let Timeframe = 4h; // Choose the best timeframe for your investigation
DeviceInfo
| where Timestamp > ago(Timeframe)
| summarize arg_max(Timestamp, *) by DeviceId //only look at the most recent entry
| extend DeviceUser = parse_json(LoggedOnUsers)
| mv-expand DeviceUser
| extend LoggedOnUsername = tostring(DeviceUser.UserName)
| extend LoggedOnDomainName = tostring(DeviceUser.DomainName)
| extend MitigationStatusObject = parse_json(MitigationStatus)
| mv-expand MitigationStatusObject
| extend IsolationStatus = tostring(MitigationStatusObject.Isolated)
| where IsolationStatus == "true"
| project Timestamp, DeviceId, DeviceName, OSPlatform, LoggedOnUsername, LoggedOnDomainName, IsolationStatus