DeviceProcessEvents
| where InitiatingProcessParentFileName contains @"ONENOTE.EXE"
| where InitiatingProcessFileName has_any (@"powershell.exe", @"pwsh.exe", @"wscript.exe", @"cscript.exe", @"mshta.exe", @"cmd.exe")