ExposureGraphEdges
    | where EdgeLabel has "has credentials of"
    | extend parsedData = parse_json(EdgeProperties)
    | extend NTLMHash = parsedData.rawData.ntlmHash.ntlmHash
    | where NTLMHash == "true"
    | project SourceNodeName, SourceNodeLabel, TargetNodeName
| join (IdentityInfo
    | where Tags has "Sensitive"
    | project AccountDisplayName
    )
on $left.TargetNodeName == $right.AccountDisplayName
| summarize by SourceNodeName, SourceNodeLabel, TargetNodeName, AccountDisplayName