DeviceEvents 
| where ActionType == "AmsiScriptDetection" 
| extend Description = tostring(parse_json(AdditionalFields).Description) 
| project Timestamp, DeviceName, DeviceId, InitiatingProcessCommandLine, Description, ReportId