DeviceTvmSoftwareInventory
| where isnotempty(EndOfSupportStatus)
| summarize DeviceCount = dcount(DeviceName) by SoftwareVendor, SoftwareName, SoftwareVersion, EndOfSupportStatus
| order by DeviceCount desc
