let LatestNet =
    DeviceNetworkInfo
    | summarize arg_max(Timestamp, *) by DeviceId, NetworkAdapterName, MacAddress
    | mv-expand IP = parse_json(IPAddresses)
    | extend
        LocalIP = tostring(IP.IPAddress),
        IPType = tostring(IP.AddressType)
    | where IPType =~ "Private"
    | project
        DeviceId,
        NetDeviceName = DeviceName,
        NetMachineGroup = MachineGroup,
        NetworkAdapterName,
        MacAddress,
        NetworkAdapterType,
        NetworkAdapterStatus,
        TunnelType,
        ConnectedNetworks,
        DnsAddresses,
        IPv4Dhcp,
        IPv6Dhcp,
        DefaultGateways,
        NetworkAdapterVendor,
        LocalIP;

let LatestDevice =
    DeviceInfo
    | summarize arg_max(Timestamp, *) by DeviceId
    | project
        DeviceId,
        DevDeviceName = DeviceName,
        AadDeviceId,
        AzureResourceId,
        AzureVmId,
        AzureVmSubscriptionId,
        HardwareUuid,
        OSArchitecture,
        OSPlatform,
        OSBuild,
        OsBuildRevision,
        OSVersion,
        OSDistribution,
        OSVersionInfo,
        DeviceCategory,
        DeviceType,
        DeviceSubtype,
        Vendor,
        Model,
        MachineGroup,
        PublicIP,
        IsInternetFacing,
        ExposureLevel,
        AssetValue,
        SensorHealthState,
        OnboardingStatus,
        IsAzureADJoined,
        JoinType,
        RegistryDeviceTag,
        DeviceManualTags,
        DeviceDynamicTags,
        CloudPlatforms,
        GcpFullResourceName,
        AwsResourceName,
        IsTransient,
        HostDeviceId,
        MitigationStatus,
        ConnectivityType,
        DiscoverySources,
        FirmwareVersions,
        LoggedOnUsers;

LatestNet
| join kind=leftouter LatestDevice on DeviceId
| project
    DeviceName = coalesce(DevDeviceName, NetDeviceName),
    DeviceId,
    AadDeviceId,
    AzureResourceId,
    AzureVmId,
    AzureVmSubscriptionId,
    HardwareUuid,
    OSPlatform,
    OSVersion,
    OSBuild,
    OsBuildRevision,
    OSArchitecture,
    OSDistribution,
    OSVersionInfo,
    DeviceCategory,
    DeviceType,
    DeviceSubtype,
    Vendor,
    Model,
    MachineGroup = coalesce(MachineGroup, NetMachineGroup),
    NetworkAdapterName,
    NetworkAdapterType,
    NetworkAdapterStatus,
    NetworkAdapterVendor,
    TunnelType,
    MacAddress,
    LocalIP,
    ConnectedNetworks,
    DnsAddresses,
    DefaultGateways,
    IPv4Dhcp,
    IPv6Dhcp,
    PublicIP,
    IsInternetFacing,
    ExposureLevel,
    AssetValue,
    SensorHealthState,
    OnboardingStatus,
    IsAzureADJoined,
    JoinType,
    RegistryDeviceTag,
    DeviceManualTags,
    DeviceDynamicTags,
    CloudPlatforms,
    GcpFullResourceName,
    AwsResourceName,
    IsTransient,
    HostDeviceId,
    MitigationStatus,
    ConnectivityType,
    DiscoverySources,
    FirmwareVersions,
    LoggedOnUsers
| order by DeviceName asc, LocalIP asc
